docs/benchmarkingUDRsim.txt
Cluster
Master  4GB RAM 2CPU 30GB HD
Worker1 2GB RAM 2CPU 30GB HD
Worker2 2GB RAM 2CPU 30GB HD


Deployment

Service UDRsim con 4 replicas y antiafinidad  2Instacias en cada Worker
Istio con afinidad a Worker1
Calico
Metrics

Estado Inicial

NAME         CPU(cores)   CPU%   MEMORY(bytes)   MEMORY%
kubemaster   689m         34%    2270Mi          59%
worker1      381m         19%    1206Mi          63%
worker2      239m         11%    1181Mi          62%



Benchmarking
Sin crash

 > h2load -D 30 -c 10 -m 10 --warm-up-time=10 -H ':method:GET' http://172.18.18.20:31382/nudr-dr/v1/subscription-data/any-ue/group-data/ee-subscriptions
finished in 40.00s, 2470.67 req/s, 927.55KB/s
requests: 74120 total, 74120 started, 74120 done, 74120 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 74121 2xx, 0 3xx, 0 4xx, 0 5xx

Con crash sin Istio

 > h2load -D 30 -c 10 -m 10 --warm-up-time=10 -H ':method:GET' http://172.18.18.20:31382/nudr-dr/v1/subscription-data/any-ue/group-data/ee-subscriptions
requests: 153830 total, 153830 started, 153830 done, 153593 succeeded, 237 failed, 0 errored, 0 timeout
status codes: 153593 2xx, 0 3xx, 0 4xx, 237 5xx

Con Crash con Istio con Retry (20 att, 0.5s)

finished in 40.00s, 3337.57 req/s, 1.22MB/s
requests: 100127 total, 100127 started, 100127 done, 100057 succeeded, 70 failed, 0 errored, 0 timeout
status codes: 100057 2xx, 0 3xx, 0 4xx, 70 5xx

finished in 40.00s, 4284.33 req/s, 1.57MB/s
requests: 128530 total, 128530 started, 128530 done, 128336 succeeded, 194 failed, 0 errored, 0 timeout
status codes: 128336 2xx, 0 3xx, 0 4xx, 194 5xx

finished in 40.00s, 4706.33 req/s, 1.72MB/s
requests: 141190 total, 141190 started, 141190 done, 141009 succeeded, 181 failed, 0 errored, 0 timeout
status codes: 141009 2xx, 0 3xx, 0 4xx, 181 5xx

Con Crash con Istio con Retry (20 att, 0.5s) con CB(3 err,10s int,1m ejec,60%)


HPA+Istio

Correo TFM



 > h2load -D 600 -c 10 -m 10 --warm-up-time=10  -H':method: POST' 'http://172.18.18.20:31382/nudm-ee/v1/msisdn-00010/ee-subscriptions' -d eesubscription.json
starting benchmark...
spawning thread #0: 10 total client(s). Timing-based test with 10s of warm-up time and 600s of main duration for measurements.
Warm-up started for thread #0.
progress: 10% of clients started
progress: 20% of clients started
progress: 30% of clients started
progress: 40% of clients started
progress: 50% of clients started
progress: 60% of clients started
progress: 70% of clients started
progress: 80% of clients started
progress: 90% of clients started
progress: 100% of clients started
Application protocol: h2c
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0

finished in 610.00s, 1453.38 req/s, 33.75KB/s
requests: 872029 total, 872029 started, 872029 done, 871962 succeeded, 67 failed, 0 errored, 0 timeout
status codes: 871962 2xx, 0 3xx, 0 4xx, 67 5xx
traffic: 19.77MB (20734887) total, 4.90MB (5136152) headers (space savings 93.85%), 2.00KB (2052) data
                     min         max         mean         sd        +/- sd
time for request:      949us       1.28s     68.79ms     77.00ms    88.83%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :     126.98      176.45      145.34       20.43    80.00%